tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "readline"
brew "asitop"
brew "automake"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "gcc"
brew "btop"
brew "ccache"
brew "clinfo"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "curl"
brew "exiftool"
brew "fzf"
brew "gdbm"
brew "git"
brew "git-lfs"
brew "openssl@1.1"
brew "glances"
brew "gnupg"
brew "htop"
brew "kubernetes-cli"
brew "lazydocker"
brew "libffi"
brew "libfido2"
brew "libyaml"
brew "llvm"
brew "lsusb"
brew "mas"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "node"
brew "openblas"
brew "openssh"
brew "postgresql@14", restart_service: true
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "r"
brew "ranger"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "ruby-install"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "trash-cli"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "zsh-autosuggestions"
brew "koekeishiya/formulae/skhd"
cask "1password"
cask "ableton-live-lite"
cask "appcleaner"
cask "autodesk-fusion"
cask "betterdisplay"
cask "blender"
cask "bruno"
cask "cursor"
cask "discord"
cask "docker"
cask "eloston-chromium"
cask "flux"
cask "focus"
cask "ghidra"
cask "gimp"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iina"
cask "intellij-idea"
cask "iterm2"
cask "keka"
cask "logisim-evolution"
cask "notion"
cask "obs"
cask "obsidian"
cask "onyx"
cask "orbstack"
cask "protonvpn"
cask "rectangle"
cask "sf-symbols"
cask "spotify"
cask "temurin"
cask "todoist"
cask "tor-browser"
cask "unity-hub"
cask "visual-studio-code"
cask "whatsapp"
cask "whisky"
cask "zerotier-one"
cask "zoom"
cask "zotero"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-preview-github-styles"
vscode "christian-kohler.npm-intellisense"
vscode "dan-c-underwood.arm"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "haskell.haskell"
vscode "ionutvmi.path-autocomplete"
vscode "jeff-hykin.better-cpp-syntax"
vscode "justusadam.language-haskell"
vscode "kevinrose.vsc-python-indent"
vscode "keyring.lua"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "mshr-h.veriloghdl"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "xyz.local-history"
