tap "browsh-org/browsh"
tap "hashicorp/tap"
tap "homebrew/autoupdate"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "riscv-software-src/riscv"
tap "supabase/tap"
brew "act"
brew "ast-grep"
brew "automake"
brew "openssl@3"
brew "readline"
brew "awscli"
brew "bat"
brew "btop"
brew "ccache"
brew "clinfo"
brew "cloc"
brew "cloudflared"
brew "cmake"
brew "cmatrix"
brew "code2prompt"
brew "coreutils"
brew "curl"
brew "libyaml"
brew "python@3.14"
brew "datasette"
brew "deno"
brew "e2fsprogs"
brew "exiftool"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "node"
brew "gemini-cli"
brew "gh"
brew "ghidra"
brew "tesseract"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glances"
brew "pinentry"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "htop"
brew "iperf3"
brew "irssi"
brew "jq"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "libffi"
brew "libfido2"
brew "vulkan-loader"
brew "llm"
brew "z3"
brew "llvm"
brew "loc"
brew "localstack"
brew "lsusb"
brew "mactop"
brew "mailsy"
brew "mas"
brew "mosh"
brew "yt-dlp"
brew "mpv"
brew "mysql", restart_service: :changed
brew "nasm"
brew "ncdu"
brew "neovim"
brew "ollama", restart_service: :changed
brew "openblas"
brew "ripgrep"
brew "opencode"
brew "openssh"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "postgresql@16"
brew "postgresql@17"
brew "pre-commit"
brew "pulumi"
brew "pyenv"
brew "python@3.11"
brew "python@3.12"
brew "qemu"
brew "r"
brew "ranger"
brew "rclone"
brew "repomix"
brew "rsync"
brew "ruby"
brew "ruby-install"
brew "ruff"
brew "sk"
brew "smartmontools"
brew "stow"
brew "tailscale", restart_service: :changed
brew "tealdeer"
brew "tex-fmt"
brew "texlive"
brew "tfenv"
brew "tig"
brew "tmux"
brew "trash-cli", link: true
brew "tree"
brew "uv"
brew "vercel-cli"
brew "vim"
brew "watch"
brew "wget"
brew "wireshark", link: false
brew "zig"
brew "zsh-autosuggestions"
brew "browsh-org/browsh/browsh"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/skhd"
brew "oven-sh/bun/bun"
brew "riscv-software-src/riscv/riscv-tools"
brew "supabase/tap/supabase"
cask "1password"
cask "1password-cli"
cask "ableton-live-lite"
cask "anydesk"
cask "appcleaner"
cask "autodesk-fusion"
cask "betterdisplay"
cask "blender"
cask "chatgpt"
cask "claude-code"
cask "codex"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "flux-app"
cask "foxglove"
cask "gcloud-cli"
cask "ghidra"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "helium-browser"
cask "iina"
cask "intellij-idea"
cask "iterm2"
cask "keka"
cask "linearmouse"
cask "lm-studio"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "moonlight"
cask "mysqlworkbench"
cask "notion"
cask "obs"
cask "obsidian"
cask "onyx"
cask "orbstack"
cask "parsec"
cask "protonvpn"
cask "raycast"
cask "rectangle"
cask "rstudio"
cask "sf-symbols"
cask "shortcat"
cask "spotify"
cask "tastytrade"
cask "temurin"
cask "thinkorswim"
cask "transmission"
cask "ukelele"
cask "unity-hub"
cask "visual-studio-code"
cask "voiceink"
cask "whatsapp"
cask "xquartz"
cask "zoom"
cask "zotero"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "GarageBand", id: 682658836
mas "GoodLinks", id: 1474335294
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "13xforever.language-x86-64-assembly"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.bookmarks"
vscode "anthropic.claude-code"
vscode "austenc.tailwind-docs"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "dan-c-underwood.arm"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "google.colab"
vscode "haskell.haskell"
vscode "hediet.debug-visualizer"
vscode "ionutvmi.path-autocomplete"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "justusadam.language-haskell"
vscode "kevinrose.vsc-python-indent"
vscode "keyring.lua"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshr-h.veriloghdl"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mushan.vscode-paste-image"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "platformio.platformio-ide"
vscode "plex.vscode-protolint"
vscode "prisma.prisma"
vscode "ranch-hand-robotics.rde-pack"
vscode "ranch-hand-robotics.rde-ros-1"
vscode "ranch-hand-robotics.urdf-editor"
vscode "rangav.vscode-thunder-client"
vscode "rdebugger.r-debugger"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "rickaym.manim-sideview"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xyz.local-history"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
cargo "cargo-outdated"
cargo "cargo-udeps"
cargo "huh"
cargo "safetensors_explorer"
cargo "siff"
cargo "sono"
