tap "hashicorp/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "riscv-software-src/riscv"
brew "openssl@3"
brew "readline"
brew "six"
brew "asitop"
brew "automake"
brew "awscli"
brew "bat"
brew "btop"
brew "ccache"
brew "clinfo"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "curl"
brew "deno"
brew "exiftool"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glances"
brew "pinentry"
brew "gnupg"
brew "gnuplot"
brew "htop"
brew "irssi"
brew "kubernetes-cli"
brew "lazydocker"
brew "libffi"
brew "libfido2"
brew "libyaml"
brew "z3"
brew "llvm"
brew "localstack"
brew "lsusb"
brew "node"
brew "mailsy"
brew "mas"
brew "mosh"
brew "nasm"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "ollama"
brew "openblas"
brew "openssh"
brew "openssl@1.1"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "postgresql@14", restart_service: :changed
brew "pulumi"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "qemu"
brew "r"
brew "ranger"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "ruby-install"
brew "ruff"
brew "stow"
brew "tesseract"
brew "tfenv", link: false
brew "tig"
brew "tldr"
brew "tmux"
brew "trash-cli", link: true
brew "tree"
brew "uv"
brew "vim"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/skhd"
brew "oven-sh/bun/bun"
brew "riscv-software-src/riscv/riscv-tools"
cask "1password"
cask "ableton-live-lite"
cask "appcleaner"
cask "autodesk-fusion"
cask "betterdisplay"
cask "blender"
cask "chatgpt"
cask "cursor"
cask "discord"
cask "docker"
cask "eloston-chromium"
cask "figma"
cask "flux"
cask "ghidra"
cask "ghostty"
cask "gimp"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "iina"
cask "intellij-idea"
cask "iterm2"
cask "itermai"
cask "keka"
cask "linearmouse"
cask "logisim-evolution"
cask "mysqlworkbench"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "onyx"
cask "orbstack"
cask "parsec"
cask "protonvpn"
cask "rectangle"
cask "rstudio"
cask "sf-symbols"
cask "shortcat"
cask "spotify"
cask "superwhisper"
cask "tastytrade"
cask "temurin"
cask "thinkorswim"
cask "todoist"
cask "tor-browser"
cask "transmission"
cask "unity-hub"
cask "visual-studio-code"
cask "whatsapp"
cask "zerotier-one"
cask "zoom"
cask "zotero"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "GarageBand", id: 682658836
mas "GoodLinks", id: 1474335294
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
vscode "13xforever.language-x86-64-assembly"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.bookmarks"
vscode "artlaman.chalice-icon-theme"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "dan-c-underwood.arm"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "haskell.haskell"
vscode "hediet.debug-visualizer"
vscode "hridoy.r-development"
vscode "ionutvmi.path-autocomplete"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jinliming2.vscode-go-template"
vscode "justusadam.language-haskell"
vscode "kevinrose.vsc-python-indent"
vscode "keyring.lua"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "million.million-lint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshr-h.veriloghdl"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mushan.vscode-paste-image"
vscode "njpwerner.autodocstring"
vscode "openai.openai-chatgpt-adhoc"
vscode "pkief.material-icon-theme"
vscode "plex.vscode-protolint"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "rdebugger.r-debugger"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "xyz.local-history"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
